{"article":[{"id":2,"title":"Socrates","text":"Socrates (/ˈsɒkrətiːz/;[2] Greek: Σωκράτης [sɔːkrátɛːs], Sōkrátēs; 470/469 – 399 BC)[1] was a classical Greek (Athenian) philosopher credited as one of the founders of Western philosophy. He is an enigmatic figure known chiefly through the accounts of classical writers, especially the writings of his students Plato and Xenophon and the plays of his contemporary Aristophanes. Plato's dialogues are among the most comprehensive accounts of Socrates to survive from antiquity, though it is unclear the degree to which Socrates himself is \"hidden behind his 'best disciple', Plato\".[3]\n\nThrough his portrayal in Plato's dialogues, Socrates has become renowned for his contribution to the field of ethics, and it is this Platonic Socrates who lends his name to the concepts of Socratic irony and the Socratic method, or elenchus. The latter remains a commonly used tool in a wide range of discussions, and is a type of pedagogy in which a series of questions is asked not only to draw individual answers, but also to encourage fundamental insight into the issue at hand. Plato's Socrates also made important and lasting contributions to the field of epistemology, and his ideologies and approach have proven a strong foundation for much Western philosophy that has followed.","datetime":"2015-12-30T13:09:32.446Z"},{"id":3,"title":"Plato","text":"Plato (/ˈpleɪtoʊ/;[1] Greek: Πλάτων Plátōn pronounced [plá.tɔːn] in Classical Attic; 428/427 or 424/423 – 348/347 BC) was a philosopher and mathematician in Classical Greece, and the founder of the Academy in Athens, the first institution of higher learning in the Western world. He is widely considered the most pivotal figure in the development of philosophy, especially the Western tradition.[2] Unlike nearly all of his philosophical contemporaries, Plato's entire œuvre is believed to have survived intact for over 2,400 years.[3]\n\nAlong with his teacher, Socrates, and his most famous student, Aristotle, Plato laid the very foundations of Western philosophy and science.[4] Alfred North Whitehead once noted: \"the safest general characterization of the European philosophical tradition is that it consists of a series of footnotes to Plato.\"[5] In addition to being a foundational figure for Western science, philosophy, and mathematics, Plato has also often been cited as one of the founders of Western religion and spirituality,[6] particularly Christianity, which Friedrich Nietzsche, amongst other scholars, called \"Platonism for the people\".[7] Plato's influence on Christian thought is often thought to be mediated by his major influence on Saint Augustine of Hippo, one of the most important philosophers and theologians in the history of Christianity.","datetime":"2015-12-30T13:10:26.777Z"}]}